<?php

return array(
    1 => 'Через форму передайте список імен, розділених комами, заберіть зайві пробіли відсортуйте імена за алфавітом, та виведіть відсортований список через кому та 1 пробіл. Використайте власну функцію для коректного сортування українських букв і,ї,є',
    'Зробіть задачу 2 попереднього розділу з використанням функції: https://phpcources.transoftgroup.com/index.php?unit=5. Потрібно додати сортування за ціною по зростанню та спаданню. Використайте usort або uasort та власну функцію для порівняння елементів',
    'Через форму (<b>через кому</b>) передайте список цілих чисел. Виведіть наступні результати: 1) Суму цих чисел; 2) Середнє значення (float); 3) Кількість парних чисел; 4) Всі непарні числа;',
    'Числами Фібоначі називають послідовність натуральних чисел, де перше число 1, друге 1, а кожне наступне - це сума двох попередніх. Виведіть перших 20 чисел Фібоначі. Задачу зробіть двома способами: з рекурсією та без.',
    'Для товарів Задачі 2 додати поле discount (знижка) та поправити виведдення ціни та сортування по ній. із урахуванням знижки',
    'Скопіюйте у директорію upload проекту більше файлів так щоб були файли за різні дати. Модифікуйте скрипт так, щоб він перевіряв чи існує, і якщо ні, то створював каталог backup. Допишіть код, який буде усі файли, створені раніше ніж 3 дні назад переміщвати у папку backup.',
    'Напишіть блок коду, який видалить у папці upload всі файли з розширенням ".txt", які містять в середині слово "тест"'
);
